mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2hgxe/common/s6e2hgxe.h
/*******************************************************************************
* EXTI_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t ENIR;
        stc_exti_enir_field_t ENIR_f;
        struct {
          union {
            __IO uint16_t ENIRL;
            struct {
              __IO uint8_t ENIRLL;
              __IO uint8_t ENIRLH;
            };
          };
          union {
            __IO uint16_t ENIRH;
            struct {
              __IO uint8_t ENIRHL;
              __IO uint8_t ENIRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t EIRR;
        stc_exti_eirr_field_t EIRR_f;
        struct {
          union {
            __IO uint16_t EIRRL;
            struct {
              __IO uint8_t EIRRLL;
              __IO uint8_t EIRRLH;
            };
          };
          union {
            __IO uint16_t EIRRH;
            struct {
              __IO uint8_t EIRRHL;
              __IO uint8_t EIRRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t EICL;
        stc_exti_eicl_field_t EICL_f;
        struct {
          union {
            __IO uint16_t EICLL;
            struct {
              __IO uint8_t EICLLL;
              __IO uint8_t EICLLH;
            };
          };
          union {
            __IO uint16_t EICLH;
            struct {
              __IO uint8_t EICLHL;
              __IO uint8_t EICLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t ELVR;
        stc_exti_elvr_field_t ELVR_f;
        struct {
          union {
            __IO uint16_t ELVRL;
            struct {
              __IO uint8_t ELVRLL;
              __IO uint8_t ELVRLH;
            };
          };
          union {
            __IO uint16_t ELVRH;
            struct {
              __IO uint8_t ELVRHL;
              __IO uint8_t ELVRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t ELVR1;
        stc_exti_elvr1_field_t ELVR1_f;
        struct {
          union {
            __IO uint16_t ELVR1L;
            struct {
              __IO uint8_t ELVR1LL;
              __IO uint8_t ELVR1LH;
            };
          };
          union {
            __IO uint16_t ELVR1H;
            struct {
              __IO uint8_t ELVR1HL;
              __IO uint8_t ELVR1HH;
            };
          };
        };
    };
    union {
        __IO uint16_t NMIRR;
        stc_exti_nmirr_field_t NMIRR_f;
        struct {
            __IO  uint8_t NMIRRL;
            __IO  uint8_t NMIRRH;
        };
    };
        __IO  uint8_t RESERVED0[2];
    union {
        __IO uint16_t NMICL;
        stc_exti_nmicl_field_t NMICL_f;
        struct {
            __IO  uint8_t NMICLL;
            __IO  uint8_t NMICLH;
        };
    };
        __IO  uint8_t RESERVED1[2];
    union {
        __IO uint32_t ELVR2;
        stc_exti_elvr2_field_t ELVR2_f;
        struct {
          union {
            __IO uint16_t ELVR2L;
            struct {
              __IO uint8_t ELVR2LL;
              __IO uint8_t ELVR2LH;
            };
          };
          union {
            __IO uint16_t ELVR2H;
            struct {
              __IO uint8_t ELVR2HL;
              __IO uint8_t ELVR2HH;
            };
          };
        };
    };
} FM_EXTI_TypeDef, FM4_EXTI_TypeDef;

/*******************************************************************************
* FLASH_IF_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t FASZR;
        stc_flash_if_faszr_field_t FASZR_f;
        struct {
          union {
            __IO uint16_t FASZRL;
            struct {
              __IO uint8_t FASZRLL;
              __IO uint8_t FASZRLH;
            };
          };
          union {
            __IO uint16_t FASZRH;
            struct {
              __IO uint8_t FASZRHL;
              __IO uint8_t FASZRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FRWTR;
        stc_flash_if_frwtr_field_t FRWTR_f;
        struct {
          union {
            __IO uint16_t FRWTRL;
            struct {
              __IO uint8_t FRWTRLL;
              __IO uint8_t FRWTRLH;
            };
          };
          union {
            __IO uint16_t FRWTRH;
            struct {
              __IO uint8_t FRWTRHL;
              __IO uint8_t FRWTRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FSTR;
        stc_flash_if_fstr_field_t FSTR_f;
        struct {
          union {
            __IO uint16_t FSTRL;
            struct {
              __IO uint8_t FSTRLL;
              __IO uint8_t FSTRLH;
            };
          };
          union {
            __IO uint16_t FSTRH;
            struct {
              __IO uint8_t FSTRHL;
              __IO uint8_t FSTRHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED0[4];
    union {
        __IO uint32_t FSYNDN;
        stc_flash_if_fsyndn_field_t FSYNDN_f;
        struct {
          union {
            __IO uint16_t FSYNDNL;
            struct {
              __IO uint8_t FSYNDNLL;
              __IO uint8_t FSYNDNLH;
            };
          };
          union {
            __IO uint16_t FSYNDNH;
            struct {
              __IO uint8_t FSYNDNHL;
              __IO uint8_t FSYNDNHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FBFCR;
        stc_flash_if_fbfcr_field_t FBFCR_f;
        struct {
          union {
            __IO uint16_t FBFCRL;
            struct {
              __IO uint8_t FBFCRLL;
              __IO uint8_t FBFCRLH;
            };
          };
          union {
            __IO uint16_t FBFCRH;
            struct {
              __IO uint8_t FBFCRHL;
              __IO uint8_t FBFCRHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED1[8];
    union {
        __IO uint32_t FICR;
        stc_flash_if_ficr_field_t FICR_f;
        struct {
          union {
            __IO uint16_t FICRL;
            struct {
              __IO uint8_t FICRLL;
              __IO uint8_t FICRLH;
            };
          };
          union {
            __IO uint16_t FICRH;
            struct {
              __IO uint8_t FICRHL;
              __IO uint8_t FICRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FISR;
        stc_flash_if_fisr_field_t FISR_f;
        struct {
          union {
            __IO uint16_t FISRL;
            struct {
              __IO uint8_t FISRLL;
              __IO uint8_t FISRLH;
            };
          };
          union {
            __IO uint16_t FISRH;
            struct {
              __IO uint8_t FISRHL;
              __IO uint8_t FISRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FICLR;
        stc_flash_if_ficlr_field_t FICLR_f;
        struct {
          union {
            __IO uint16_t FICLRL;
            struct {
              __IO uint8_t FICLRLL;
              __IO uint8_t FICLRLH;
            };
          };
          union {
            __IO uint16_t FICLRH;
            struct {
              __IO uint8_t FICLRHL;
              __IO uint8_t FICLRHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED2[212];
    union {
        __IO uint32_t CRTRMM;
        stc_flash_if_crtrmm_field_t CRTRMM_f;
        struct {
          union {
            __IO uint16_t CRTRMML;
            struct {
              __IO uint8_t CRTRMMLL;
              __IO uint8_t CRTRMMLH;
            };
          };
          union {
            __IO uint16_t CRTRMMH;
            struct {
              __IO uint8_t CRTRMMHL;
              __IO uint8_t CRTRMMHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED3[12];
    union {
        __IO uint32_t FGPDM1;
        stc_flash_if_fgpdm1_field_t FGPDM1_f;
        struct {
          union {
            __IO uint16_t FGPDM1L;
            struct {
              __IO uint8_t FGPDM1LL;
              __IO uint8_t FGPDM1LH;
            };
          };
          union {
            __IO uint16_t FGPDM1H;
            struct {
              __IO uint8_t FGPDM1HL;
              __IO uint8_t FGPDM1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FGPDM2;
        stc_flash_if_fgpdm2_field_t FGPDM2_f;
        struct {
          union {
            __IO uint16_t FGPDM2L;
            struct {
              __IO uint8_t FGPDM2LL;
              __IO uint8_t FGPDM2LH;
            };
          };
          union {
            __IO uint16_t FGPDM2H;
            struct {
              __IO uint8_t FGPDM2HL;
              __IO uint8_t FGPDM2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FGPDM3;
        stc_flash_if_fgpdm3_field_t FGPDM3_f;
        struct {
          union {
            __IO uint16_t FGPDM3L;
            struct {
              __IO uint8_t FGPDM3LL;
              __IO uint8_t FGPDM3LH;
            };
          };
          union {
            __IO uint16_t FGPDM3H;
            struct {
              __IO uint8_t FGPDM3HL;
              __IO uint8_t FGPDM3HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FGPDM4;
        stc_flash_if_fgpdm4_field_t FGPDM4_f;
        struct {
          union {
            __IO uint16_t FGPDM4L;
            struct {
              __IO uint8_t FGPDM4LL;
              __IO uint8_t FGPDM4LH;
            };
          };
          union {
            __IO uint16_t FGPDM4H;
            struct {
              __IO uint8_t FGPDM4HL;
              __IO uint8_t FGPDM4HH;
            };
          };
        };
    };
} FM_FLASH_IF_TypeDef, FM4_FLASH_IF_TypeDef;

