mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2hgxe/common/s6e2hgxe.h
/*******************************************************************************
* MFT Registers MFT2
*   Register Definition
*******************************************************************************/
#define FM_MFT2_OCU_OCCP0                         *((volatile uint16_t*)(0x40022102UL))
#define FM4_MFT2_OCU_OCCP0                        *((volatile uint16_t*)(0x40022102UL))
#define FM_MFT2_OCU_OCCP1                         *((volatile uint16_t*)(0x40022106UL))
#define FM4_MFT2_OCU_OCCP1                        *((volatile uint16_t*)(0x40022106UL))
#define FM_MFT2_OCU_OCCP2                         *((volatile uint16_t*)(0x4002210AUL))
#define FM4_MFT2_OCU_OCCP2                        *((volatile uint16_t*)(0x4002210AUL))
#define FM_MFT2_OCU_OCCP3                         *((volatile uint16_t*)(0x4002210EUL))
#define FM4_MFT2_OCU_OCCP3                        *((volatile uint16_t*)(0x4002210EUL))
#define FM_MFT2_OCU_OCCP4                         *((volatile uint16_t*)(0x40022112UL))
#define FM4_MFT2_OCU_OCCP4                        *((volatile uint16_t*)(0x40022112UL))
#define FM_MFT2_OCU_OCCP5                         *((volatile uint16_t*)(0x40022116UL))
#define FM4_MFT2_OCU_OCCP5                        *((volatile uint16_t*)(0x40022116UL))
#define FM_MFT2_OCU_OCSA10                        *((volatile  uint8_t*)(0x40022118UL))
#define FM4_MFT2_OCU_OCSA10                       *((volatile  uint8_t*)(0x40022118UL))
#define FM_MFT2_OCU_OCSB10                        *((volatile  uint8_t*)(0x40022119UL))
#define FM4_MFT2_OCU_OCSB10                       *((volatile  uint8_t*)(0x40022119UL))
#define FM_MFT2_OCU_OCSD10                        *((volatile uint16_t*)(0x4002211AUL))
#define FM4_MFT2_OCU_OCSD10                       *((volatile uint16_t*)(0x4002211AUL))
#define FM_MFT2_OCU_OCSA32                        *((volatile  uint8_t*)(0x4002211CUL))
#define FM4_MFT2_OCU_OCSA32                       *((volatile  uint8_t*)(0x4002211CUL))
#define FM_MFT2_OCU_OCSB32                        *((volatile  uint8_t*)(0x4002211DUL))
#define FM4_MFT2_OCU_OCSB32                       *((volatile  uint8_t*)(0x4002211DUL))
#define FM_MFT2_OCU_OCSD32                        *((volatile uint16_t*)(0x4002211EUL))
#define FM4_MFT2_OCU_OCSD32                       *((volatile uint16_t*)(0x4002211EUL))
#define FM_MFT2_OCU_OCSA54                        *((volatile  uint8_t*)(0x40022120UL))
#define FM4_MFT2_OCU_OCSA54                       *((volatile  uint8_t*)(0x40022120UL))
#define FM_MFT2_OCU_OCSB54                        *((volatile  uint8_t*)(0x40022121UL))
#define FM4_MFT2_OCU_OCSB54                       *((volatile  uint8_t*)(0x40022121UL))
#define FM_MFT2_OCU_OCSD54                        *((volatile uint16_t*)(0x40022122UL))
#define FM4_MFT2_OCU_OCSD54                       *((volatile uint16_t*)(0x40022122UL))
#define FM_MFT2_OCU_OCSC                          *((volatile  uint8_t*)(0x40022125UL))
#define FM4_MFT2_OCU_OCSC                         *((volatile  uint8_t*)(0x40022125UL))
#define FM_MFT2_OCU_OCSE0                         *((volatile uint16_t*)(0x40022128UL))
#define FM4_MFT2_OCU_OCSE0                        *((volatile uint16_t*)(0x40022128UL))
#define FM_MFT2_OCU_OCSE1                         *((volatile uint32_t*)(0x4002212CUL))
#define FM4_MFT2_OCU_OCSE1                        *((volatile uint32_t*)(0x4002212CUL))
#define FM_MFT2_OCU_OCSE2                         *((volatile uint16_t*)(0x40022130UL))
#define FM4_MFT2_OCU_OCSE2                        *((volatile uint16_t*)(0x40022130UL))
#define FM_MFT2_OCU_OCSE3                         *((volatile uint32_t*)(0x40022134UL))
#define FM4_MFT2_OCU_OCSE3                        *((volatile uint32_t*)(0x40022134UL))
#define FM_MFT2_OCU_OCSE4                         *((volatile uint16_t*)(0x40022138UL))
#define FM4_MFT2_OCU_OCSE4                        *((volatile uint16_t*)(0x40022138UL))
#define FM_MFT2_OCU_OCSE5                         *((volatile uint32_t*)(0x4002213CUL))
#define FM4_MFT2_OCU_OCSE5                        *((volatile uint32_t*)(0x4002213CUL))
#define FM_MFT2_FRT_TCCP0                         *((volatile uint16_t*)(0x40022142UL))
#define FM4_MFT2_FRT_TCCP0                        *((volatile uint16_t*)(0x40022142UL))
#define FM_MFT2_FRT_TCDT0                         *((volatile uint16_t*)(0x40022146UL))
#define FM4_MFT2_FRT_TCDT0                        *((volatile uint16_t*)(0x40022146UL))
#define FM_MFT2_FRT_TCSA0                         *((volatile uint16_t*)(0x40022148UL))
#define FM4_MFT2_FRT_TCSA0                        *((volatile uint16_t*)(0x40022148UL))
#define FM_MFT2_FRT_TCSC0                         *((volatile uint16_t*)(0x4002214AUL))
#define FM4_MFT2_FRT_TCSC0                        *((volatile uint16_t*)(0x4002214AUL))
#define FM_MFT2_FRT_TCCP1                         *((volatile uint16_t*)(0x4002214EUL))
#define FM4_MFT2_FRT_TCCP1                        *((volatile uint16_t*)(0x4002214EUL))
#define FM_MFT2_FRT_TCDT1                         *((volatile uint16_t*)(0x40022152UL))
#define FM4_MFT2_FRT_TCDT1                        *((volatile uint16_t*)(0x40022152UL))
#define FM_MFT2_FRT_TCSA1                         *((volatile uint16_t*)(0x40022154UL))
#define FM4_MFT2_FRT_TCSA1                        *((volatile uint16_t*)(0x40022154UL))
#define FM_MFT2_FRT_TCSC1                         *((volatile uint16_t*)(0x40022156UL))
#define FM4_MFT2_FRT_TCSC1                        *((volatile uint16_t*)(0x40022156UL))
#define FM_MFT2_FRT_TCCP2                         *((volatile uint16_t*)(0x4002215AUL))
#define FM4_MFT2_FRT_TCCP2                        *((volatile uint16_t*)(0x4002215AUL))
#define FM_MFT2_FRT_TCDT2                         *((volatile uint16_t*)(0x4002215EUL))
#define FM4_MFT2_FRT_TCDT2                        *((volatile uint16_t*)(0x4002215EUL))
#define FM_MFT2_FRT_TCSA2                         *((volatile uint16_t*)(0x40022160UL))
#define FM4_MFT2_FRT_TCSA2                        *((volatile uint16_t*)(0x40022160UL))
#define FM_MFT2_FRT_TCSC2                         *((volatile uint16_t*)(0x40022162UL))
#define FM4_MFT2_FRT_TCSC2                        *((volatile uint16_t*)(0x40022162UL))
#define FM_MFT2_FRT_TCAL                          *((volatile uint32_t*)(0x40022164UL))
#define FM4_MFT2_FRT_TCAL                         *((volatile uint32_t*)(0x40022164UL))
#define FM_MFT2_OCU_OCFS10                        *((volatile  uint8_t*)(0x40022168UL))
#define FM4_MFT2_OCU_OCFS10                       *((volatile  uint8_t*)(0x40022168UL))
#define FM_MFT2_OCU_OCFS32                        *((volatile  uint8_t*)(0x40022169UL))
#define FM4_MFT2_OCU_OCFS32                       *((volatile  uint8_t*)(0x40022169UL))
#define FM_MFT2_OCU_OCFS54                        *((volatile  uint8_t*)(0x4002216AUL))
#define FM4_MFT2_OCU_OCFS54                       *((volatile  uint8_t*)(0x4002216AUL))
#define FM_MFT2_ICU_ICFS10                        *((volatile  uint8_t*)(0x4002216CUL))
#define FM4_MFT2_ICU_ICFS10                       *((volatile  uint8_t*)(0x4002216CUL))
#define FM_MFT2_ICU_ICFS32                        *((volatile  uint8_t*)(0x4002216DUL))
#define FM4_MFT2_ICU_ICFS32                       *((volatile  uint8_t*)(0x4002216DUL))
#define FM_MFT2_ADCMP_ACFS10                      *((volatile  uint8_t*)(0x40022170UL))
#define FM4_MFT2_ADCMP_ACFS10                     *((volatile  uint8_t*)(0x40022170UL))
#define FM_MFT2_ADCMP_ACFS32                      *((volatile  uint8_t*)(0x40022171UL))
#define FM4_MFT2_ADCMP_ACFS32                     *((volatile  uint8_t*)(0x40022171UL))
#define FM_MFT2_ADCMP_ACFS54                      *((volatile  uint8_t*)(0x40022172UL))
#define FM4_MFT2_ADCMP_ACFS54                     *((volatile  uint8_t*)(0x40022172UL))
#define FM_MFT2_ICU_ICCP0                         *((volatile uint16_t*)(0x40022176UL))
#define FM4_MFT2_ICU_ICCP0                        *((volatile uint16_t*)(0x40022176UL))
#define FM_MFT2_ICU_ICCP1                         *((volatile uint16_t*)(0x4002217AUL))
#define FM4_MFT2_ICU_ICCP1                        *((volatile uint16_t*)(0x4002217AUL))
#define FM_MFT2_ICU_ICCP2                         *((volatile uint16_t*)(0x4002217EUL))
#define FM4_MFT2_ICU_ICCP2                        *((volatile uint16_t*)(0x4002217EUL))
#define FM_MFT2_ICU_ICCP3                         *((volatile uint16_t*)(0x40022182UL))
#define FM4_MFT2_ICU_ICCP3                        *((volatile uint16_t*)(0x40022182UL))
#define FM_MFT2_ICU_ICSA10                        *((volatile  uint8_t*)(0x40022184UL))
#define FM4_MFT2_ICU_ICSA10                       *((volatile  uint8_t*)(0x40022184UL))
#define FM_MFT2_ICU_ICSB10                        *((volatile  uint8_t*)(0x40022185UL))
#define FM4_MFT2_ICU_ICSB10                       *((volatile  uint8_t*)(0x40022185UL))
#define FM_MFT2_ICU_ICSA32                        *((volatile  uint8_t*)(0x40022188UL))
#define FM4_MFT2_ICU_ICSA32                       *((volatile  uint8_t*)(0x40022188UL))
#define FM_MFT2_ICU_ICSB32                        *((volatile  uint8_t*)(0x40022189UL))
#define FM4_MFT2_ICU_ICSB32                       *((volatile  uint8_t*)(0x40022189UL))
#define FM_MFT2_WFG_WFTF10                        *((volatile uint16_t*)(0x4002218EUL))
#define FM4_MFT2_WFG_WFTF10                       *((volatile uint16_t*)(0x4002218EUL))
#define FM_MFT2_WFG_WFTA10                        *((volatile uint16_t*)(0x40022190UL))
#define FM4_MFT2_WFG_WFTA10                       *((volatile uint16_t*)(0x40022190UL))
#define FM_MFT2_WFG_WFTB10                        *((volatile uint16_t*)(0x40022192UL))
#define FM4_MFT2_WFG_WFTB10                       *((volatile uint16_t*)(0x40022192UL))
#define FM_MFT2_WFG_WFTF32                        *((volatile uint16_t*)(0x40022196UL))
#define FM4_MFT2_WFG_WFTF32                       *((volatile uint16_t*)(0x40022196UL))
#define FM_MFT2_WFG_WFTA32                        *((volatile uint16_t*)(0x40022198UL))
#define FM4_MFT2_WFG_WFTA32                       *((volatile uint16_t*)(0x40022198UL))
#define FM_MFT2_WFG_WFTB32                        *((volatile uint16_t*)(0x4002219AUL))
#define FM4_MFT2_WFG_WFTB32                       *((volatile uint16_t*)(0x4002219AUL))
#define FM_MFT2_WFG_WFTF54                        *((volatile uint16_t*)(0x4002219EUL))
#define FM4_MFT2_WFG_WFTF54                       *((volatile uint16_t*)(0x4002219EUL))
#define FM_MFT2_WFG_WFTA54                        *((volatile uint16_t*)(0x400221A0UL))
#define FM4_MFT2_WFG_WFTA54                       *((volatile uint16_t*)(0x400221A0UL))
#define FM_MFT2_WFG_WFTB54                        *((volatile uint16_t*)(0x400221A2UL))
#define FM4_MFT2_WFG_WFTB54                       *((volatile uint16_t*)(0x400221A2UL))
#define FM_MFT2_WFG_WFSA10                        *((volatile uint16_t*)(0x400221A4UL))
#define FM4_MFT2_WFG_WFSA10                       *((volatile uint16_t*)(0x400221A4UL))
#define FM_MFT2_WFG_WFSA32                        *((volatile uint16_t*)(0x400221A8UL))
#define FM4_MFT2_WFG_WFSA32                       *((volatile uint16_t*)(0x400221A8UL))
#define FM_MFT2_WFG_WFSA54                        *((volatile uint16_t*)(0x400221ACUL))
#define FM4_MFT2_WFG_WFSA54                       *((volatile uint16_t*)(0x400221ACUL))
#define FM_MFT2_WFG_WFIR                          *((volatile uint16_t*)(0x400221B0UL))
#define FM4_MFT2_WFG_WFIR                         *((volatile uint16_t*)(0x400221B0UL))
#define FM_MFT2_WFG_NZCL                          *((volatile uint16_t*)(0x400221B4UL))
#define FM4_MFT2_WFG_NZCL                         *((volatile uint16_t*)(0x400221B4UL))
#define FM_MFT2_ADCMP_ACMP0                       *((volatile uint16_t*)(0x400221BAUL))
#define FM4_MFT2_ADCMP_ACMP0                      *((volatile uint16_t*)(0x400221BAUL))
#define FM_MFT2_ADCMP_ACMP1                       *((volatile uint16_t*)(0x400221BEUL))
#define FM4_MFT2_ADCMP_ACMP1                      *((volatile uint16_t*)(0x400221BEUL))
#define FM_MFT2_ADCMP_ACMP2                       *((volatile uint16_t*)(0x400221C2UL))
#define FM4_MFT2_ADCMP_ACMP2                      *((volatile uint16_t*)(0x400221C2UL))
#define FM_MFT2_ADCMP_ACMP3                       *((volatile uint16_t*)(0x400221C6UL))
#define FM4_MFT2_ADCMP_ACMP3                      *((volatile uint16_t*)(0x400221C6UL))
#define FM_MFT2_ADCMP_ACMP4                       *((volatile uint16_t*)(0x400221CAUL))
#define FM4_MFT2_ADCMP_ACMP4                      *((volatile uint16_t*)(0x400221CAUL))
#define FM_MFT2_ADCMP_ACMP5                       *((volatile uint16_t*)(0x400221CEUL))
#define FM4_MFT2_ADCMP_ACMP5                      *((volatile uint16_t*)(0x400221CEUL))
#define FM_MFT2_ADCMP_ACSA                        *((volatile uint16_t*)(0x400221D0UL))
#define FM4_MFT2_ADCMP_ACSA                       *((volatile uint16_t*)(0x400221D0UL))
#define FM_MFT2_ADCMP_ACSC0                       *((volatile  uint8_t*)(0x400221D4UL))
#define FM4_MFT2_ADCMP_ACSC0                      *((volatile  uint8_t*)(0x400221D4UL))
#define FM_MFT2_ADCMP_ACSD0                       *((volatile  uint8_t*)(0x400221D5UL))
#define FM4_MFT2_ADCMP_ACSD0                      *((volatile  uint8_t*)(0x400221D5UL))
#define FM_MFT2_ADCMP_ACMC0                       *((volatile  uint8_t*)(0x400221D6UL))
#define FM4_MFT2_ADCMP_ACMC0                      *((volatile  uint8_t*)(0x400221D6UL))
#define FM_MFT2_ADCMP_ACSC1                       *((volatile  uint8_t*)(0x400221D8UL))
#define FM4_MFT2_ADCMP_ACSC1                      *((volatile  uint8_t*)(0x400221D8UL))
#define FM_MFT2_ADCMP_ACSD1                       *((volatile  uint8_t*)(0x400221D9UL))
#define FM4_MFT2_ADCMP_ACSD1                      *((volatile  uint8_t*)(0x400221D9UL))
#define FM_MFT2_ADCMP_ACMC1                       *((volatile  uint8_t*)(0x400221DAUL))
#define FM4_MFT2_ADCMP_ACMC1                      *((volatile  uint8_t*)(0x400221DAUL))
#define FM_MFT2_ADCMP_ACSC2                       *((volatile  uint8_t*)(0x400221DCUL))
#define FM4_MFT2_ADCMP_ACSC2                      *((volatile  uint8_t*)(0x400221DCUL))
#define FM_MFT2_ADCMP_ACSD2                       *((volatile  uint8_t*)(0x400221DDUL))
#define FM4_MFT2_ADCMP_ACSD2                      *((volatile  uint8_t*)(0x400221DDUL))
#define FM_MFT2_ADCMP_ACMC2                       *((volatile  uint8_t*)(0x400221DEUL))
#define FM4_MFT2_ADCMP_ACMC2                      *((volatile  uint8_t*)(0x400221DEUL))
#define FM_MFT2_ADCMP_ACSC3                       *((volatile  uint8_t*)(0x400221E0UL))
#define FM4_MFT2_ADCMP_ACSC3                      *((volatile  uint8_t*)(0x400221E0UL))
#define FM_MFT2_ADCMP_ACSD3                       *((volatile  uint8_t*)(0x400221E1UL))
#define FM4_MFT2_ADCMP_ACSD3                      *((volatile  uint8_t*)(0x400221E1UL))
#define FM_MFT2_ADCMP_ACMC3                       *((volatile  uint8_t*)(0x400221E2UL))
#define FM4_MFT2_ADCMP_ACMC3                      *((volatile  uint8_t*)(0x400221E2UL))
#define FM_MFT2_ADCMP_ACSC4                       *((volatile  uint8_t*)(0x400221E4UL))
#define FM4_MFT2_ADCMP_ACSC4                      *((volatile  uint8_t*)(0x400221E4UL))
#define FM_MFT2_ADCMP_ACSD4                       *((volatile  uint8_t*)(0x400221E5UL))
#define FM4_MFT2_ADCMP_ACSD4                      *((volatile  uint8_t*)(0x400221E5UL))
#define FM_MFT2_ADCMP_ACMC4                       *((volatile  uint8_t*)(0x400221E6UL))
#define FM4_MFT2_ADCMP_ACMC4                      *((volatile  uint8_t*)(0x400221E6UL))
#define FM_MFT2_ADCMP_ACSC5                       *((volatile  uint8_t*)(0x400221E8UL))
#define FM4_MFT2_ADCMP_ACSC5                      *((volatile  uint8_t*)(0x400221E8UL))
#define FM_MFT2_ADCMP_ACSD5                       *((volatile  uint8_t*)(0x400221E9UL))
#define FM4_MFT2_ADCMP_ACSD5                      *((volatile  uint8_t*)(0x400221E9UL))
#define FM_MFT2_ADCMP_ACMC5                       *((volatile  uint8_t*)(0x400221EAUL))
#define FM4_MFT2_ADCMP_ACMC5                      *((volatile  uint8_t*)(0x400221EAUL))
#define FM_MFT2_FRT_TCSD                          *((volatile  uint8_t*)(0x400221ECUL))
#define FM4_MFT2_FRT_TCSD                         *((volatile  uint8_t*)(0x400221ECUL))

